Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedLoad.ObjectAttachedToType Property
 Gets or sets the type of the object the load is attached to.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObject.AnalysisObjectEnum ObjectAttachedToType { get; set; }
Public Property ObjectAttachedToType As AnalysisObject.AnalysisObjectEnum
	Get
	Set
Property Value
Type: AnalysisObject.AnalysisObjectEnum
See Also
Reference
AnalysisDecomposedLoad Class
Tekla.Structures.Analysis Namespace